
//工行接口刷卡方式
//详情参见工商银行文档中cardflag值设置
//此值必须与工行接口配置文件中的值一致
var trans_cardflag = 0;
/////////////////////////////////////
function openTrans(){
    try{
        var ret = Trans1.OnTrans("OPN000000");
        //处理返回值
		if(ret.length>=6)
		{
			if(ret.substring(0,6)=="000000")
			{   
				 //签到成功
				 alert('签到成功');
			}
			else
			{   
			    //失败信息提示
			    alert(getTransInfo(ret));
			}
		}
		else if(ret.length==0)
		{
			//工行没有返回数据
			alert('银行没有返回数据');
		}
		else
		{
		    alert('银行返回信息出错，返回数据为：“' + ret + '”');//工行返回其它信息
		}
    }
    catch(e){alert("未安装工行刷卡控件!");}
}
function getTransInfo(id)
{
    var code = new Array();
    var info = new Array();
    
    code[0] = "000000";
    info[0] = "交易成功";
    code[1] = "001111";
    info[1] = "配置文件不存在";
    code[2] = "001001";
    info[2] = "非法交易";
    code[3] = "001002";
    info[3] = "非法金额";
    code[4] = "001003";
    info[4] = "非法流水号";
    code[5] = "001004";
    info[5] = "非法批次号";
    code[6] = "001005";
    info[6] = "取刷卡方式错误";
    code[7] = "001006";
    info[7] = "刷卡错误";
    code[8] = "001007";
    info[8] = "磁道信息错误";
    code[9] = "001008";
    info[9] = "取密码错误";
    code[10] = "001009";
    info[10] = "取配置错误";
    code[11] = "002000";
    info[11] = "系统错";
    code[12] = "002001";
    info[12] = "发送交易包错误";
    code[13] = "002002";
    info[13] = "接收响应包超时";
//
    code[15] = "010000";
    info[15] = "终端未签到";
    code[16] = "020000";
    info[16] = "终端不可用";
    code[17] = "030000";
    info[17] = "终端已签到";
    code[18] = "040000";
    info[18] = "销售终端未签到";
    code[19] = "050000";
    info[19] = "非法卡";
    code[20] = "060000";
    info[20] = "过期卡";
    code[21] = "070000";
    info[21] = "止付卡";
    code[22] = "080000";
    info[22] = "密码错请重输";
    code[23] = "090000";
    info[23] = "未知交易";
    code[24] = "100000";
    info[24] = "非止付卡";
    code[25] = "110000";
    info[25] = "止付卡";
    code[26] = "120000";
    info[26] = "交易未能处理";
    code[27] = "130000";
    info[27] = "无未知交易";
    code[28] = "140000";
    info[28] = "柜员轧账错";
    code[29] = "160000";
    info[29] = "交易未授权";
    code[30] = "170000";
    info[30] = "原始交易已冲正";
    code[31] = "180000";
    info[31] = "权限不匹配";
    code[32] = "190000";
    info[32] = "非联名卡";
    code[33] = "210000";
    info[33] = "异地卡";
    code[34] = "220000";
    info[34] = "异地交易";
    code[35] = "230000";
    info[35] = "非取款卡";
    code[36] = "240000";
    info[36] = "通讯校验错";
    code[37] = "250000";
    info[37] = "无效的操作员号";
    code[38] = "260000";
    info[38] = "操作员需签到";
    code[39] = "270000";
    info[39] = "信息文件出错";
    code[40] = "280000";
    info[40] = "已签到";
    code[41] = "290000";
    info[41] = "操作员密码错";
    code[42] = "300000";
    info[42] = "卡号校验错";
    code[43] = "320000";
    info[43] = "同一张卡不能转帐";
    code[44] = "330000";
    info[44] = "已取消";
    code[45] = "340000";
    info[45] = "非法交易";
    code[46] = "350000";
    info[46] = "金额不匹配";
    code[47] = "360000";
    info[47] = "非法交易";
    code[48] = "370000";
    info[48] = "对话超时";
    code[49] = "380000";
    info[49] = "不可退货";
    code[50] = "390000";
    info[50] = "报文格式错";
    code[51] = "410000";
    info[51] = "超消费比例";
    code[52] = "420000";
    info[52] = "已兑奖";
    code[53] = "430000";
    info[53] = "已取消兑奖";
    code[54] = "450000";
    info[54] = "流水号错"
    code[55] = "460000";
    info[55] = "授权已确认";
    code[56] = "470000";
    info[56] = "消费已付，交易拒绝";
    code[57] = "490000";
    info[57] = "帐不平";
    code[58] = "510000";
    info[58] = "商户资金不足";
    code[59] = "520000";
    info[59] = "帐户文件不可用";
    code[60] = "530000";
    info[60] = "原始交易未找到";
    code[61] = "540000";
    info[61] = "该授权已消费";
    code[62] = "550000";
    info[62] = "超限额";
    code[63] = "560000";
    info[63] = "请索权";
    code[64] = "570000";
    info[64] = "付出卡不存在";
    code[65] = "580000";
    info[65] = "不允许本地取现";
    code[66] = "590000";
    info[66] = "止付卡";
    code[67] = "600000";
    info[67] = "记录不存在";
    code[68] = "610000";
    info[68] = "系统故障";
    code[69] = "620000";
    info[69] = "只做本地取现";
    code[70] = "630000";
    info[70] = "授权号错";
    code[71] = "640000";
    info[71] = "非法卡";
//
    code[73] = "650000";
    info[73] = "非法卡";
    code[74] = "660000";
    info[74] = "过期卡";
    code[75] = "670000";
    info[75] = "积分不足";
    code[76] = "680000";
    info[76] = "预授权当日不可取消";
    code[77] = "690000";
    info[77] = "帐户不存在";
    code[78] = "700000";
    info[78] = "已超兑奖期";
    code[79] = "710000";
    info[79] = "非法卡";
    code[80] = "720000";
    info[80] = "检查帐户错";
    code[81] = "730000";
    info[81] = "交易未能处理";
    code[82] = "740000";
    info[82] = "应用未找到";
    code[83] = "750000";
    info[83] = "卡片状态不对";
    code[84] = "760000";
    info[84] = "上门收款错误";
    code[85] = "770000";
    info[85] = "外卡错误信息";
    code[86] = "780000";
    info[86] = "卡表版本错误";
    code[87] = "810000";
    info[87] = "请与发卡行联系";
    code[88] = "820000";
    info[88] = "个人标5号错";
    code[89] = "830000";
    info[89] = "交易不能处理";
    code[90] = "840000";
    info[90] = "主机通讯故障";
    code[91] = "850000";
    info[91] = "数据传输错";
    code[92] = "870000";
    info[92] = "总行文件打开错";
    code[93] = "880000";
    info[93] = "超限额，请电话索权";
    code[94] = "890000";
    info[94] = "通讯校验错";
    code[95] = "900000";
    info[95] = "无相应记录";
    code[96] = "910000";
    info[96] = "权限不匹配";
    code[97] = "920000";
    info[97] = "读数据库文件失败";
    code[98] = "930000";
    info[98] = "商场记录错";
    code[99] = "940000";
    info[99] = "更新数据库文件失败";
    code[100] = "950000";
    info[100] = "不能在本商户使用";
    code[101] = "960000";
    info[101] = "异地网未开通";
    code[102] = "970000";
    info[102] = "非法交易";
    code[103] = "980000";
    info[103] = "应用子系统未激活";
    code[104] = "990000";
    info[104] = "交易过程未发现";
    
    var str="";
    
    for(i=0;i<code.length;i++)
    {
        if(code[i]==id.substring(0,6)){
            str = info[i]+"("+code[i]+")";
            break;
        }
    }
    if(str.length==0)str="参数传递错误!";
    return str;

}

//左补0
function padLeft(str,lenght){    
  if(str.length == lenght)    
   return str;
  else if(str.length>lenght)
    return str.substring(0,lenght);
  else
   return padLeft("0" +str,lenght);    
}

//取工商返回数据中某一值
function getbankcode(str, type) 
{
    var e = [0,6,21,29,31,50,62,66,72,76,98,104,110,122];

    if (type < e.length)  {  return str.substr(e[type], e[type + 1] - e[type]) }
    return "";
}
